BASE_URL_LAPTOP = 'https://market.yandex.ru/catalog--noutbuki/54544/list?cpa=0&hid=91013&onstock=0&local-offers-first=0'

FILTERS_LAPTOP = {
    'дисплей_диагональ' : '15083339',
    'дисплей_частота_обновления' : '17309463',
    'микрофон' : '5085169',
    'камера' : '5085174',
    'оперативная_память' : '15938685', #есть еще фильтр 15938685, в чем разница не знаю
    'накопитель_объем' : '5085125',
    'подсветка' : '6262740',
    'беспроводные_модули_wi_fi' : '5085139', 
    'беспроводные_модули_bluetooth' : '5085141',
    'процессор_количество_ядер' : '6068613',
    'видеокарта_тип' : '5085117',
    'видеокарта_объем' : '17322770',
    'вес' : '5085185',
    'бюджет_до' : 'priceto',
    'бюджет_от' : 'pricefrom'}

FILTERS_LAPTOP_VALUES = {
    '15083339': {'11-11.9' :'15083351', 'до 11' : '15083353', '12-12.9' : '15083346', '13-13.9' : '15083347', '14-14.9' : '15083348', '15-15.9' : '15083349', '16-16.9' : '15083350', '17 и более' : '15083352'},
    '17309463': {'~' : '~'},
    '5085169' : {'да' : '1', 'нет' : '0'},
    '5085174' : {'да' : '1', 'нет' : '0'},
    '15938685': {'~' : '~'},
    '17445209': {'~' : '~'},
    '6262740' : {'да' : '1', 'нет' : '0'},
    '5085139' : {'да' : '1', 'нет' : '0'},
    '5085141' : {'да' : '1', 'нет' : '0'},
    '6068613' : {'1' : '12106927', '2' : '12106928', '3' : '12106929', '4' : '12106930', '5' : '19035770', '6' : '12106931', '8' : '12106932'},
    '5085117' : {'встроенная' : '13903954', 'дискретная' : '13904061', 'дискретная и встроенная' : '13904106'}, 
    '17322770': {'1' : '17324206', '2' : '17324211', '4' : '17324212', '8' : '17324210'},
    '5085185' : {'~' : '~'},
    'priceto' : {'=' : '='},
    'pricefrom' : {'=' : '='},
    '5085125' : {'~' : '='}
}

def formatFilter(filterId, valId):
    return "&glfilter={}%3A{}".format(filterId, valId)
def formatRangeFilter(filterId, val):
    return "&glfilter={}%3A~{}".format(filterId, val)
def formatPriceFilter(filterId, val):
    return "&{}={}".format(filterId, val)